package com.company;

public class Main {

    public static void main(String[] args) {
	// 今天讲的是Java的变量 这是一个上课（在校）的笔记 内容比较浅显

        //学到一个表示方法
        //234 可以记为： 2.34e+2
        //0.0234 可以记为： 2.34e-2

        //byte 1字节 范围在 -2的7次 到 2的7次-1
        //short 2字节 下面的范围就不写了
        //int 4字节

        //long 8字节
        //对于长整型 long = 123L
        //当超出了 int类型的话 可以在赋值的时候后面加上 L
        //未超出的话 可以省略 L

        //float 后面一定要加 F 或者 f
        //double 后面可以加 D（d），也可以不加
        //注意：小数默认是 double

        //char 2字节 它进行了扩展 可以加的东西更多
        //赋值的时候 像这样 'a'

        //布尔类型变量
        //需要讲解

        //变量的类型转换
        //有两种:
        //1:自动类型转换 隐式类型转换
        //条件：两种类型彼此兼容 还有一个没听到
        //2：强制类型转换
        //目标类型 变量 = （目标类型）值
        //注意：可能会损失精度，int类型 转换成 byte



        //还讲了

        //变量的作用域

        //算术运算符

        //赋值运算符
        //这样是可以的
        int x,y,z;
        x = y = z = 1;
        //错误的
        //int q = w = e = 2

        //比较运算符
        //注意 == 和 = 不一样 不要搞错了

        //逻辑运算符
        //选择语句

        //感受：我感觉这个老师在胡讲！感觉，充满疑惑！
    }
}
