package com.company;

public class Main {

    public static void main(String[] args) {
        //数据类型的创建
        int a = 0;
        //错误的演示 int a; 必须要初始化，不初始化就是错的

        //变量命名
        int _a = 0;//不建议这样
        //int a- = 1;//不建议这样
        int $a = 2;//不建议这样
        //int 2a = 3; 这样是错的

        //然后 int 类型是4字节 没有32位 和64位的区分
        //它的实际范围大概在 负两亿到两亿之间（范围）

        //对了 java 没有全局变量、
        //Java多加了一个标识符 $$$

        //这是学习的一个体验笔记
        //感受:每天的任务很重，今天只是简单的学习了Java的第一节课，对Java初始化初步了解，老师讲的很不错。
        //然后，今天的事比较多，学校的事也很多，所以心情比较烦，晚一点还要背单词，今天就先到这里吧！
        //明天见！
    }
}
